{"Pages":[{"Title":"Job Search","Content":"<html>\n<head>\n\t<title></title>\n</head>\n<body>\n<h1><big><strong>Clarify Your Career Goals</strong></big></h1>\n\n<ol>\n\t<li>Identify your interests, values, and abilities</li>\n\t<li>Reflect on your education, experience, and personal attributes</li>\n\t<li>Determine what you can offer employers</li>\n\t<li>Consider your personal preferences (geographic location, employer size, work environment)</li>\n</ol>\n\n<p>&nbsp;</p>\n\n<h2><strong>1. Identify your Top-10 Employer List</strong></h2>\n\n<ul>\n\t<li>Conduct company research on employer websites and news media sites</li>\n\t<li>Review common entry-level job descriptions on employer websites</li>\n</ul>\n\n<h2><strong>2. Job Search Tools</strong></h2>\n\n<p>It is highly recommended that students utilize <strong>COUGLINK</strong>, your primary resource when searching for jobs, part-time work, co-ops and internships, on-campus interviews, career development workshops, and event registration. COUGLINK is accessible online through the WSU Academic Success and Career Center website or at http://www.couglink.org.</p>\n\n<p>Additionally, the Voiland College has purchased <b>CareerShift, </b>which provides an easy-to-use, approach for cracking the &ldquo;hidden job market&rdquo; and for managing your job hunt all in one place. You&rsquo;ll be able to search for jobs and save your searches, find and save a list of contacts, create resumes and cover letters, and put them together in a targeted e-mail or postal mail campaigns. Then you can track your responses from &ldquo;Come in for an interview&rdquo; to &ldquo;You&rsquo;re hired.&rdquo;</p>\n\n<p><b>How CareerShift Works</b></p>\n\n<p><b>MY JOBS &ndash; </b>to search for jobs and save them to your CareerShift account.</p>\n\n<p><b>MY CONTACTS &ndash; </b>to search for companies and contacts, then save and manage your networking list.</p>\n\n<p><b>MY DOCUMENTS &ndash; </b>to create as many targeted resumes and cover letters needed or upload your current documents.</p>\n\n<p><b>MY CAMPAIGNS &ndash; </b>to automatically create unlimited email and postal mail campaigns with your saved contacts and documents.</p>\n\n<p><b>MY CALENDAR &ndash; </b>to set your email alerts, get organized for follow up tasks.</p>\n\n<p>&nbsp;<b>With CareerShift you can: </b></p>\n\n<ul>\n\t<li>Search every job listing, including job boards and company websites</li>\n\t<li>Get inside contact information immediately, including email addresses, for millions of companies</li>\n\t<li>Create and organize all of your documents</li>\n\t<li>Confidentially market yourself</li>\n\t<li>Remain focused and organized</li>\n\t<li>Access your secure, private account from anywhere, anytime, 24/7</li>\n</ul>\n\n<p>Log into <a href=\"http://voiland.careershift.com\" target=\"_blank\">http://voiland.careershift.com</a> and click <i>Sign Up</i> to get started.</p>\n\n<p>There are a variety of other online job boards that may also serve as helpful resources for job seekers. However, it is important to remember that many of the popular job boards are heavily utilized and may increase the amount of competition you face in the application process. A good strategy is to seek out job boards that are more specific to your industry or professional interests. For example, seek out job boards operated by local, state, and national professional organizations or postings that are specific to one company or geographic region.</p>\n\n<p>Listed below are some of the top job boards recommended by PPEL:</p>\n\n<ul>\n\t<li><a href=\"http://www.indeed.com\" target=\"_blank\">Indeed.com</a>&nbsp; Generic search engine for job and co-op/internship listings</li>\n\t<li><a href=\"http://www.glassdoor.com\" target=\"_blank\">Glassdoor.com</a>&nbsp; American website search engine for job and co-op/internship listings, and where former or current employees anonymously review companies and management.</li>\n\t<li><a href=\"http://www.usajobs.gov\" target=\"_blank\">USAJobs.gov</a>&nbsp; Features federal jobs from a variety of professional fields and government agencies.</li>\n\t<li><a href=\"http://http//www.internships.com\" target=\"_blank\">Internships.com</a> &nbsp;Resources for students seeking co-ops or internships.</li>\n\t<li><a href=\"http://universitycollege.wsu.edu/units/undergraduateresearch/programs-funding\" target=\"_blank\">WSU Office of Undergraduate Research</a> &nbsp;Resources for students seeking a research internship.</li>\n\t<li><a href=\"http://online.goinglobal.com\" target=\"_blank\">Goinglobal.com</a> &nbsp;Resources for country-specific career and employment information.</li>\n\t<li><a href=\"http://www.linkedin.com\" target=\"_blank\">LinkedIn.com</a> &nbsp;Search and browse job postings from a wide variety of companies (log in with your LinkedIn account to access the &quot;Jobs&quot; page).</li>\n</ul>\n\n<h2><strong>3. Build Your Resume</strong></h2>\n\n<p>Make a great first impression on prospective employers with a polished r&eacute;sum&eacute; and cover letter. Start by completing the R&eacute;sum&eacute; Coloring Book, WSU&rsquo;s free online resource designed to walk you through the process, breaking it down into easy to follow color-coded sections. Start developing your r&eacute;sum&eacute; today.&nbsp;<a href=\"https://ascc.wsu.edu/career-services/resumes-and-cover-letters/\" target=\"_blank\">https://ascc.wsu.edu/career-services/resumes-and-cover-letters/</a></p>\n\n<h2><strong>4. Develop &amp; Practice&nbsp;a 60-Second Elevator Speech</strong></h2>\n\n<p>What is a &quot;60-Second Elevator Speech&quot;?</p>\n\n<p>For the purpose of professional networking, one of the keys to your success is to make a really strong first impression. To do this, you need to create a personal &quot;commercial.&quot;&nbsp;It is essentially an overview of your experience, skills, strengths, accomplishments and goals&nbsp;all in 60 seconds!</p>\n\n<p><strong>When Will I Use It?</strong></p>\n\n<p>You will use your 60-second elevator speech throughout your professional life. Some relevant uses include:</p>\n\n<ul>\n\t<li>When introducing yourself to a potential employer at a career fair.</li>\n\t<li>At an interview.</li>\n\t<li>In a cover letter to highlight your background and key abilities.</li>\n\t<li>At professional networking events&nbsp;when you are asked to introduce yourself.</li>\n\t<li>In cold calling employers for an internship or future job.</li>\n</ul>\n\n<p><strong>What Should I Include in My 60-Second Elevator Speech?</strong></p>\n\n<p>The structure of a 60-second speech generally follows this pattern:</p>\n\n<ol>\n\t<li>Who you are, plus a credential</li>\n\t<li>A specific objective</li>\n\t<li>How you have demonstrated your interest</li>\n\t<li>Why you are qualified</li>\n\t<li>Ask a specific question about their organization/available position(s), based on your research</li>\n</ol>\n\n<p><strong>What Should I Keep in Mind about Developing My 60-Second Speech?</strong></p>\n\n<p>PRACTICE, PRACTICE, PRACTICE!</p>\n\n<p>Your 60-second elevator speech should be conversational and natural. Although prepared in advance, it should never sound memorized. You want to appear confident, enthusiastic, poised and professional. Make it memorable, but not outrageous. You are competing with many other qualified candidates. Your commercial should allow you to stand out a bit from the crowd. Whether it is the vocabulary you choose or a specific achievement you mention, you want to engage the listener and give them an opportunity to see your personality.</p>\n\n<p>Be prepared for follow-up questions. You may be asked for more information or to elaborate on something you said, which will keep the conversation going. Part of your strategy is to develop a rapport with the interviewer and a good commercial and follow-up will help to set a positive tone. Vary your closing to fit the circumstances. At a job fair or networking event you want to be proactive and may want to consider an action question such as &quot;May I have your business card and contact you&quot;.</p>\n\n<p><strong>Questions to Think About in Developing Your 60-Second Elevator Speech:</strong></p>\n\n<ol>\n\t<li>What is your career goal? (Usually frame it in the form of doing something for someone)</li>\n\t<li>What skill, strength, or experience do you have that would help you realize that goal?</li>\n\t<li>What accomplishment proves you have that skill, strength, or experience?</li>\n\t<li>What are you searching for in a job or internship?</li>\n\t<li>How can you immediately benefit the organization?</li>\n</ol>\n\n<p><strong>Starting Your 60-Second Speech</strong></p>\n\n<p>For example, your speech might look something like this:</p>\n\n<ol>\n\t<li>\n\t<p>My name is ________________________________.</p>\n\t</li>\n\t<li>\n\t<p>I am a ______________ major here at WSU and I am looking for (type of opportunity, e.g.,&nbsp;structural engineering internship) ___________________.</p>\n\t</li>\n\t<li>\n\t<p>I have experience/interest/skills in ___________, for example ____________________.</p>\n\t</li>\n\t<li>\n\t<p>I feel I could apply these same skills/abilities in your _______________ opportunity. (You&#39;ll need to do some research into what they&#39;re looking for to be able to comment on this!)</p>\n\t</li>\n\t<li>\n\t<p>Can you tell me more about this opportunity (or can you tell me more about career opportunities in your company)?</p>\n\t</li>\n</ol>\n\n<p><strong>Record Your 60-Second Elevator Speech&nbsp;</strong></p>\n\n<p>Go to the &quot;Video&quot; tab and record your answer to the question, &quot;Tell me about yourself.&quot; &nbsp;You can practice recording your answer as many times as needed until you feel you have a well-rehearsed answer, then save the recording to share with future employers.</p>\n</body>\n</html>\n"},{"Title":"Interviews","Content":"<html>\n<head>\n\t<title></title>\n</head>\n<body>\n<h1><strong>General Interview Tips</strong></h1>\n\n<h2><u>Before the Interview</u></h2>\n\n<ol>\n\t<li>Learn as much as you can about the company beforehand -- know its products and services, its profit margin, its management, its culture, its dress code, and anything else that might be relevant. Good sources are the ASCC Resource Room and website, Holland Library, and the Internet.</li>\n\t<li>Confirm the date, time, and location of the interview; allow plenty of time to get to the interview and, if possible, visit the site in advance and time how long it takes to get there.</li>\n\t<li>Identify your skills that relate to the job; review your resume and be able to elaborate on it.</li>\n\t<li>Practice interviewing and request feedback from others; do a mock interview with the PPEL or ASCC office.</li>\n\t<li>Prepare questions you&#39;ll ask ahead of time, write them down, and take them with you to the interview.</li>\n\t<li>Know the general salary range for the position.</li>\n\t<li>Plan what to wear and make sure your suit is pressed and fits properly, your shoes are shined, and your hair and nails are well groomed.</li>\n</ol>\n\n<h2><u>During the Interview</u></h2>\n\n<ol>\n\t<li>Arrive early (10-15 minutes)</li>\n\t<li>Bring extra copies of your resume and a list of references.</li>\n\t<li>Listen closely to the interviewer&#39;s questions; ask for clarification if needed.</li>\n\t<li>Speak slowly, clearly, and concisely; don&#39;t be afraid to pause for a moment to collect your thoughts.</li>\n\t<li>Give concrete examples to back up your claims and stay positive.</li>\n\t<li>Be honest. Don&#39;t try to cover up mistakes. Instead, focus on how you learned from them.</li>\n\t<li>Never slight a former employer or colleague.</li>\n\t<li>Be aware of your posture and body language; watch your grammar.</li>\n\t<li>Be sure to ask about the next steps in the hiring process before you leave; ask for business card.</li>\n</ol>\n\n<h2><u>After the Interview</u></h2>\n\n<ol>\n\t<li>Write a thank you letter to the interviewer(s) within 24 hours.</li>\n\t<li>Evaluate your performance</li>\n\t<li>Follow-up with a phone call to find out the status of your application (if the employer has not contacted you within the stated time frame).</li>\n</ol>\n\n<h2><strong>Audio/Video Interview</strong></h2>\n\n<p>Many companies have moved to an online asynchronous (one-way) video or audio interview process where the applicant is interviewed via a pre-recorded video or telephone interview and the applicant&#39;s responses to pre-recorded questions are recorded and reviewed at a later date. Understand that this type of interview is convenient and efficient for the interviewer. Hiring managers use this type of interview to reduce costs and screen candidates in an efficient manner. It is in the applicant&#39;s best interest to treat these types of interviews seriously so they convey their skills in an effective manner for the interviewer.</p>\n\n<p>A time limit will likely be set for each question. With some asynchronous interviews, the candidate many be given a practice session or allow a re-do of an answer, but with other formats it is &quot;one and done.&quot; If you are provided with a practice session, definitely utilize this as an opportunity to test out the logistics of the recording and to gain comfort in the model.</p>\n\n<h3><u>Before the Interview</u></h3>\n\n<p>1. Be aware of your environment</p>\n\n<ul>\n\t<li>Tell roommates, spouse, kids you have an interview. Ask them not to disturb you.</li>\n\t<li>Put pets away. Send loud pets out for a walk with friends.</li>\n\t<li>Pick a good spot. The spot should have natural light and be relatively neat and clean. No beds, kitchens or clutter in the background.</li>\n</ul>\n\n<p>2. Pre-Video preparation</p>\n\n<ul>\n\t<li>No swivel chairs. Makes you look nervous and uneasy. Sit in a stationary chair.</li>\n\t<li>Be sure to turn the lights on. Dark room? Take two table lamps and place them on either side of your camera/computer. Make sure the room behind you is well lit.</li>\n</ul>\n\n<p>3. Technical Setup</p>\n\n<ul>\n\t<li>Don&#39;t use your built-in Webcam, it&#39;s&nbsp;low quality. Invest in a stand-alone webcam.</li>\n\t<li>Audio is king. If you&#39;ll be using your computer for the interview, purchase an external microphone and test the level before the interview.</li>\n\t<li>Don&#39;t use WIFI as it can be unreliable. Plug in to Ethernet.</li>\n\t<li>Give yourself time to learn your new system.</li>\n</ul>\n\n<p>4. Get familiar with the streaming or audio service the interviewer is using.</p>\n\n<ul>\n\t<li>Complete a couple of dry runs with your friends.</li>\n\t<li>Test your set up. Try using the PPEL Video recording feature (see Video tab)&nbsp;where you can save the conversation/recording and review later to see how you look, act, and sound (clothing, background, lighting, streaming quality, audio quality, etc.).</li>\n\t<li>Place sticky notes (reminders of what you want to say) close to the webcam so that your eyes are not moving far away from the camera when you refer to your notes. That way you won&#39;t look like you are reading notes. Use sticky notes for the questions you want to ask or for a list of your accomplishments, etc.</li>\n</ul>\n\n<h3><u>During the Interview</u></h3>\n\n<p>Video</p>\n\n<ol>\n\t<li>Keep camera at eye level. You don&#39;t want to be looking down at people, no double chins or to see your nose hairs.</li>\n\t<li>Maintain eye contact with the camera, not the people on the screen. Treat this type of interview like any other interview and dress professionally.</li>\n</ol>\n\n<p>Audio Only or Telephone</p>\n\n<ol>\n\t<li>Have the documentation you need at your fingertips. Easy access to the company and job information will allow you to confidentially respond to questions.</li>\n\t<li>Know your answers to common questions. Review the Common Interview Questions.</li>\n\t<li><em>Smile</em> while on the phone. Place a mirror by the phone and make a point of looking into it and smiling. You&#39;ll sound more upbeat and engaged.</li>\n\t<li>Focus on your language and voice. Speak clearly, stay upbeat, and use positive language.</li>\n\t<li>Make sure to thank the interviewer after you are done answering the last question.</li>\n\t<li>If this is not a recorded interview, don&#39;t hang up without asking the interviewer for the next step, plus contact information.</li>\n</ol>\n\n<h2><strong>Common Interview Questions</strong></h2>\n\n<h2><strong>Behavioral Questions</strong></h2>\n\n<p>Behavioral-based interviewing is based on the premise that past behavior/performance predicts future behavior/performance. Past performance examples may come from work experience, activities, hobbies, volunteer work, family life, etc. At an interview, it is important to focus on your experiences, behaviors, and dimensions (which include knowledge, skills, and abilities), that are job related.</p>\n\n<p>The STAR Technique</p>\n\n<p>Your answer to a behavior-based question must explain the situation you were in, the task (problem) for which you were responsible, the specific action you took, and the results of your actions (STAR). Your answer must contain all of these components to be a complete STAR.</p>\n\n<p>Sample Behavioral Questions</p>\n\n<ol>\n\t<li>Tell me about a time when you had to resolve a difference of opinion with a co-worker, customer, or supervisor.</li>\n\t<li>Describe the way you handled a specific problem involving a person with differing values, ideas, and beliefs in your current or previous job.</li>\n\t<li>Tell me about a time when you went above and beyond the call of duty to get a job done.</li>\n\t<li>Tell me about a recent work related problem and the actions you took to solve it.</li>\n\t<li>Tell me about a time when you had to exert leadership in a crisis situation.</li>\n\t<li>Share an example of how you were able to motivate others.</li>\n</ol>\n\n<p>Traditional Questions</p>\n\n<ol>\n\t<li>Tell me about yourself.</li>\n\t<li>What are your greatest strengths and weaknesses?</li>\n\t<li>How would a friend or professor describe you?</li>\n\t<li>What two or three accomplishments have given you the most satisfaction? Why?</li>\n\t<li>Why did you select your college or major?</li>\n\t<li>Tell us what you know about our organization.</li>\n</ol>\n\n<p>Analytical Questions</p>\n\n<p>Tip: Don&#39;t worry about getting the questions right. The goal is to demonstrate how you would logically try to solve the problem.</p>\n\n<ol>\n\t<li>How many golf balls can you fit in a swimming pool?</li>\n\t<li>How many pennies, standing end-to-end, would it take to reach from the ground to the top of the Empire State Building?</li>\n\t<li>How many telephones are there in the U.S.?</li>\n\t<li>How would you redesign an ATM Machine to make it more user-friendly?</li>\n</ol>\n\n<h2><strong>Record Answers to Interview Questions / Save in online Portfolio</strong></h2>\n\n<p>Go to the &quot;Video&quot; tab and record your answer to the sample questions provided.&nbsp; You can practice recording your answer as many times as needed until you feel you have a well-rehearsed answer, then save the recordings to share with future employers.</p>\n</body>\n</html>\n"},{"Title":"Career Tips","Content":"<html>\n<head>\n\t<title></title>\n</head>\n<body>\n<h1 id=\"careerFairTips\"><strong>Career Tips</strong></h1>\n\n<h2><strong>At the Career Fair</strong></h2>\n\n<p>Career Fairs are a great way to connect with employers to collect information, submit resumes or arrange interviews. Goals for the career fair should include:</p>\n\n<ul>\n\t<li>Discuss job search strategies, interview and resume tips, or finding an internship or co-op with recruiters.</li>\n\t<li>Develop a job search network &acirc;&euro;&ldquo; collect referrals to other departments/divisions within an organization.</li>\n\t<li>Meet with new, less familiar organizations and discover unexpected opportunities.</li>\n</ul>\n\n<h4>Career Fair Prep</h4>\n\n<ul>\n\t<li>Perfect your resume&nbsp;- Have your resume&nbsp;critiqued by PPEL or ASCC.</li>\n\t<li>Get your professional clothes ready (typically, business casual)</li>\n\t<li>Practice your 60-second elevator pitch</li>\n\t<li>Research the employers you want to meet with and prepare a list of general and specific questions</li>\n</ul>\n\n<h4>What to Bring</h4>\n\n<ul>\n\t<li>Multiple resumes - Bring 10-15 copies to the fair, but be aware that some employers cannot accept hard copy resumes and will ask you to apply online (due to federal regulations).</li>\n\t<li>Business cards</li>\n\t<li>Dress appropriately (business casual) - Think of the Career Expo as your first interview. A dark pressed suit and tie for men and clean pressed pants suit (or skirt) for women is always appropriate. Skirts should be not shorter than 2&quot; above the knee. Wear comfortable professional and polished shoes. Be conservative with the cologne, perfume and makeup (some recruiters may be allergic to the smells). If you can go without your backpack, do so. Instead, carry a portfolio with a notepad, copies of your resume, a pen, and any other pertinent information. If you carry a purse, keep it small. Avoid visible piercings and tattoos.</li>\n\t<li>Padfolio, notepaper and pen</li>\n</ul>\n\n<h4>During the Fair/Expo</h4>\n\n<ol>\n\t<li>Turn off your cell phone and don&#39;t chew gum or candy.</li>\n\t<li>Arrive early. Be there when recruiters are fresh and attentive. Arrive before the majority of other students get there.</li>\n\t<li>Walk around to meet employers alone&nbsp;you might have friends at the fair who you check in with, but don&#39;t travel as a posse</li>\n\t<li>Take time to target organizations that interest you. But, also keep an open mind and consider companies you are not familiar with,&nbsp;there are great opportunities everywhere. If a table is less crowded, you will have the opportunity to converse longer with the representative.</li>\n\t<li>Be strategic&nbsp;talk to your top 3 employers first, others if you have time</li>\n\t<li>Scan employers&#39; handouts. Instead of just getting in line, approach the table from the side to quietly pick up materials to review. Step back far enough to be able to listen to and observe recruiters speaking to other students. Determine if your 60-second elevator speech needs to be adjusted.</li>\n\t<li>Take the initiative and introduce yourself with a smile and firm handshake.</li>\n\t<li>Give your resume to the representative. Launch into your 60-second elevator speech. Ask questions from the list you prepared. Ask about the application procedure. Don&#39;t ask about salary or benefits.</li>\n\t<li>Speak slowly and confidently</li>\n\t<li>Examples of appropriate questions: What are the characteristics of an ideal candidate? What are the staffing needs of your organization at XYZ location? What are the travel opportunities/requirements?</li>\n\t<li>Ask about opportunities and next steps if there are specific openings</li>\n\t<li>Get a business card or a contact name from every person you meet. Write interesting facts, notes or additional contact names on the back of the card. Use this information to follow-up after the fair.</li>\n\t<li>Take quick breaks between rounds of visits to freshen up and take a breather</li>\n\t<li>Don&#39;t dominate recruiters, be mindful of other students waiting in line</li>\n\t<li>If you are an international student, don&#39;t say that you need a job to stay in the US. Address the employer professionally and connect your skills to the needs of the company.</li>\n\t<li>Limit your give-away item collecting</li>\n\t<li>Thank recruiters after speaking with them</li>\n\t<li>Take notes as soon as you walk away from a table</li>\n</ol>\n\n<h4>After the Fair</h4>\n\n<ul>\n\t<li>Take a few minutes immediately after fair to sort through your notes and make a list of follow-up items</li>\n\t<li>Follow up and thank recruiters of particular interest (don&#39;t have to follow-up with everyone)</li>\n\t<li>Follow up with online applications, or by sending resume&nbsp;and cover letter to appropriate contact</li>\n\t<li>Set up informational interviews with individuals at companies/organizations of particular interest to you, and with alumni in these organizations</li>\n\t<li>Check in with your career office with specific questions</li>\n</ul>\n\n<h2><strong>Networking Tips</strong></h2>\n\n<p>Networking is a critical part of the job search and is consistently ranked as the number one way students find employment. To be a successful networker, you must come up with a specific networking pitch (60-second elevator pitch). Some things to include:</p>\n\n<ul>\n\t<li>Name</li>\n\t<li>Professional identity (not as student, but as the professional you want to be)</li>\n\t<li>3 selling points:\n\t<ul>\n\t\t<li>-Something technical related</li>\n\t\t<li>-Something soft skill related</li>\n\t\t<li>-What motivates you as a professional</li>\n\t</ul>\n\t</li>\n\t<li>Goals&nbsp;what kind of work are you looking for? (keep options open)</li>\n\t<li>Exit statements:&nbsp;say thanks; say something memorable; have a definite end</li>\n</ul>\n\n<p>Networking is not a one-way street. It is a series of valuable relationships that require ongoing attention. A key component of networking is reciprocation; others help you, and you help them in return. Some ways you might help are: Providing valuable introductions, increasing the scope of other&#39;s networks, offering original ideas, teaching a skill, lending support to other&#39;s activities, reducing another&#39;s workload, contributing objective perspective, showing appreciation, making recommendations, providing feedback, sharing unique abilities. These are just a few ideas. Perhaps you can think of more.</p>\n\n<p>Remember networking is a give and take relationship. Success in networking depends on personal commitment, dedication and follow-up. With that in mind, here are some important keys to creating successful networking relationships.</p>\n\n<h4><u>Networking Do&#39;s</u></h4>\n\n<ul>\n\t<li>Keep notes (i.e., a card file system,&nbsp;spreadsheet, or database).</li>\n\t<li>Give as much as you get from your network.</li>\n\t<li>Report back to anyone who has given you a hand, and give thanks.</li>\n\t<li>Follow up on all leads.</li>\n\t<li>Take advice in the spirit it was intended. (Don&#39;t say, &quot;I tried that and it didn&#39;t work&quot; or&nbsp;&quot;You don&#39;t understand.&quot;)</li>\n\t<li>Pick the right people to talk to.</li>\n\t<li>Be prepared for a slump.</li>\n\t<li>Be patient. If they don&#39;t have an answer now, they may be able to get it for you.</li>\n</ul>\n\n<h4><u>Networking Don&#39;ts</u></h4>\n\n<ul>\n\t<li>Ask anyone for a job while networking</li>\n\t<li>Be afraid to ask for what you need</li>\n\t<li>Tell everything to everybody (i.e., why you left your last job)</li>\n\t<li>Pass up opportunities (i.e., social functions)</li>\n\t<li>Expect job offers or for others to make appointments for you</li>\n\t<li>Be discouraged (if brushed off)</li>\n\t<li>Expect an instant, magic answer. Plant the seed</li>\n\t<li>Complain about your situation or your last job</li>\n</ul>\n\n<h4><u>Small talk Examples:</u></h4>\n\n<ul>\n\t<li>Have you had a good week so far?</li>\n\t<li>How has the weather been in your area?</li>\n\t<li>Did you hear about ____ in the news?</li>\n\t<li>How did you get involved in XYZ company?</li>\n\t<li>What do you like most about working at XYZ company?</li>\n\t<li>Are you from this area originally?</li>\n\t<li>Where did you go to school?</li>\n\t<li>What do you like to do outside of work?</li>\n\t<li>Don&#39;t bring up religious, political, or other inflammatory topics. Don&#39;t ask anything too personal, such as marital status or family questions.</li>\n</ul>\n\n<h4><strong>Maintaining your Network</strong></h4>\n\n<ol>\n\t<li>Send a quick email, for example, &quot;It was so nice to meet you at the XYZ function yesterday! Best of luck with your son&#39;s baseball championship this weekend!&quot; If you want to move things along, you could add, &quot;We started to talk about XXX and I&#39;d love to continue the conversation. How does your schedule look next week?&quot;</li>\n\t<li>Make sure you check in every 4-6 months and that you aren&#39;t asking for something every conversation. Networking should be reciprocal and beneficial to both parties.</li>\n\t<li>Share content you know is relevant to your contact: industry news, new product or service, etc.</li>\n\t<li>Connect with your network on LinkedIn and remember to reach out to them on birthdays, work anniversaries or new jobs.</li>\n\t<li>Always follow-up with your contacts and give them a report on your progress. Be sure to mention how you followed their advice.</li>\n</ol>\n\n<h2><strong>Interviewing Do&#39;s and Don&#39;ts</strong></h2>\n\n<p>Keep in mind that you are one of many candidates employers are interviewing. You need to be memorable, and stand out, in a good way. To do this, you need to look unique, be informed, and be pleasant. Here are a few tips to keep in mind.</p>\n\n<h4>DO:</h4>\n\n<ul>\n\t<li>Research the company and the position you&#39;re applying for.</li>\n\t<li>Research common interview questions and practice your answers.</li>\n\t<li>Dress appropriately for the job you want, be neatly groomed, and dress relatively conservatively. Bring breath mints.</li>\n\t<li>Map out how to get to the location before the interview, and plan to arrive 10 minutes early. If something happens and you must be late, phone the office as soon as you know that you are running behind.</li>\n\t<li>Bring all requested paperwork with you to the interview including your resume, an application, references, identification, etc. Extra copies of your resume and a portfolio (if applicable) are also good to bring.</li>\n\t<li>Be polite and cordial to everyone you meet; you never know whose opinion will count.</li>\n\t<li>Offer a firm handshake and make eye contact when meeting someone.</li>\n\t<li>Repeat the person&#39;s name to help you remember it.</li>\n\t<li>Maintain good eye contact during the interview.</li>\n\t<li>Approach the interview with enthusiasm about the job and the company.</li>\n\t<li>Stress your achievements and talents.</li>\n\t<li>Give detailed answers to questions with examples. Explain how you would go about tackling the assignments and challenges of the position.</li>\n\t<li>Have an opinion when asked.</li>\n\t<li>Answer questions like, &quot;What&#39;s your biggest flaw?&quot; intelligently, but honestly.</li>\n\t<li>Show off any research you&#39;ve done about the company, position, and industry with examples or educated questions.</li>\n\t<li>Take time to think about how to answer an unexpected question. You can repeat the question to give yourself a little extra time.</li>\n\t<li>Prepare to answer questions about your salary requirements.</li>\n\t<li>Ask intelligent questions about the job, company, or industry. It pays to prepare a few before the interview.</li>\n\t<li>Close by indicating that you want the job and asking about next steps.</li>\n\t<li>Get business cards from your interviewers, or at least make a note of the correct spelling of their names.</li>\n\t<li>Write down some notes after your interview so that you don&acirc;&euro;&trade;t forget any details of what was discussed.</li>\n\t<li>Write a thank you note and send it within 24 hours of the interview.</li>\n\t<li>Evaluate the interviewer, the company, and the position to be sure it&#39;s right for you.</li>\n</ul>\n\n<h4>DON&#39;T:</h4>\n\n<ul>\n\t<li>Rehearse your answers so much that you sound like you&#39;re just reciting from memory.</li>\n\t<li>Dress too casually, too flamboyantly or in revealing clothing.</li>\n\t<li>Arrive smelling (too much perfume, cigarette smoke, etc.).</li>\n\t<li>Be late to your interview if you can possibly avoid it.</li>\n\t<li>Arrive stressed.</li>\n\t<li>Bring anyone else with you to the interview (a parent, spouse, friend, child, pet, etc.).</li>\n\t<li>Address your interviewer by his or her first name until invited to do so. Don&#39;t assume you know how to pronounce their name, either; it&#39;s better to ask the receptionist to be sure. Don&#39;t assume that a female interviewer is a Mrs. or a Miss; use Ms. unless told otherwise.</li>\n\t<li>Slouch, fidget, or yawn while being interviewed. Don&acirc;&euro;&trade;t chew gum or bring food or drink into an interview.</li>\n\t<li>Tell jokes.</li>\n\t<li>Bring up controversial subjects.</li>\n\t<li>Be aggressive.</li>\n\t<li>Be self-aggrandizing, insinuating that you are perfect and have zero flaws.</li>\n\t<li>Take out any frustrations about the job search process on your interviewer.</li>\n\t<li>Speak negatively about your current or former company, boss, or coworkers.</li>\n\t<li>Lie.</li>\n\t<li>Offer up any negative information about yourself if not asked.</li>\n\t<li>Make excuses.</li>\n\t<li>Be afraid to ask for clarification if you don&#39;t understand a question.</li>\n\t<li>Answer every question with a simple&nbsp;answer.</li>\n\t<li>Bring up personal or family problems.</li>\n\t<li>Ask personal questions of your interviewer.</li>\n\t<li>Answer your cell phone, check messages, or text during an interview.</li>\n\t<li>Act as though you&#39;re desperate and would take any job.</li>\n\t<li>Act as though you&#39;re just shopping around or interviewing for practice.</li>\n\t<li>Indicate that you&#39;re only interested in the job because of the salary, benefits, or geographic location. Don&#39;t indicate that you intend the job to be a &quot;stepping stone&quot;&nbsp;to something else.</li>\n\t<li>Bring up salary, benefits, vacation time, or bonuses until after you&#39;ve received an offer.</li>\n\t<li>Say that you don&#39;t have any questions.</li>\n\t<li>Call immediately after the interview to find out if you got the job, or make repeated phone calls.</li>\n</ul>\n\n<h2><strong>Business Etiquette</strong></h2>\n\n<h4>First Impressions</h4>\n\n<p>How you present yourself to others speaks volumes. People often form first impressions about others within seconds of the first meeting, thus it is crucial to ensure you present yourself a a professional.</p>\n\n<ol>\n\t<li>Stand straight, make eye contact, turn towards people when they are speaking, and smile</li>\n\t<li>Your backpack or purse and the things you carry in them say something about you. Messy items may detract from your professional image.</li>\n\t<li>Be sure to shake hands, palm to palm, with a gentle firmness</li>\n\t<li>Look alert</li>\n\t<li>Kindness and courtesy count!</li>\n\t<li>Arrive early to meetings</li>\n\t<li>Respect people&#39;s personal space. This may be different from your own.</li>\n</ol>\n\n<h4>Email Etiquette</h4>\n\n<ol>\n\t<li>Address your emails with &quot;Dear Mr./Ms. _____,&quot;</li>\n\t<li>Have a professional email address. Make an address that is a combination of your first and last name.</li>\n\t<li>Be sure to check your email regularly while job hunting. Company representatives may ask for an interview in less than 24-hours.</li>\n\t<li>Do not use emoticons like smiley faces or hearts, and do not overuse the exclamation point.</li>\n\t<li>Use complete sentences and check for spelling and grammar errors. While spell check is helpful, it may not catch every error. And, please, no &quot;text talking.&quot;</li>\n\t<li>Conclude your email with a professional signature that includes your full name, university, graduation year, phone number and email address.</li>\n\t<li>Return emails within 24-hours</li>\n</ol>\n\n<h4>Voicemail Etiquette</h4>\n\n<ol>\n\t<li>Record a professional personalized greeting. Be sure to identify your full name, what message you would like the caller to leave you, and how you will follow-up. Create your recording in a quiet setting, no background noise.</li>\n\t<li>Remove all ring-back tones.</li>\n\t<li>Return phone calls within 24 hours.</li>\n\t<li>When leaving a voicemail, clearly state your full name and spell it if necessary. State your purpose for calling (30-seconds or less). Slowly state your phone number and consider repeating it along with your name.</li>\n</ol>\n\n<h4 id=\"socialMediaAdvice\"><strong>Social Media Do&#39;s and Dont&#39;s</strong></h4>\n\n<ol>\n\t<li>Clean up social media sites (Facebook, Twitter, You Tube, LinkedIn, etc.). Remove questionable items (political commentary, religion, marital status, controversial pictures, or other items) from your site and make your accounts private while job searching.</li>\n\t<li>Pick you profile picture carefully.</li>\n\t<li>Google your full name in quotes to see what information recruiters could find about you.</li>\n\t<li>Do not &quot;friend&quot; on Facebook (or connect via other social media sites) employers with whom you have interviewed.</li>\n\t<li>Do not post about your experience on Twitter or Facebook. Employers may be able to access information posted even though you made the content private.</li>\n\t<li>Regularly check your privacy settings, because they may be modified or lost with new updates.</li>\n</ol>\n</body>\n</html>\n"},{"Title":"Contact Us","Content":"<html>\n<head>\n\t<title></title>\n</head>\n<body>\n<div style=\"background: rgb(238, 238, 238); border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\">Voiland College&nbsp;Professional Practice and Experiential Learning (PPEL)</div>\n\n<div style=\"background: rgb(238, 238, 238); border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\">Electrical and Mechanical Engineering (EME) Building, Room 202H</div>\n\n<div style=\"background: rgb(238, 238, 238); border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\">(509) 335-3740 &nbsp; | &nbsp; vcea.internships@wsu.edu</div>\n\n<div style=\"background: rgb(238, 238, 238); border: 1px solid rgb(204, 204, 204); padding: 5px 10px; text-align: center;\">PPEL Office drop in hours are M-F 3-4 p.m. or by appointment</div>\n</body>\n</html>\n"},{"Title":"Privacy Policy","Content":"<html>\n<head>\n\t<title></title>\n</head>\n<body>\n<p><font face=\"Calibri,sans-serif\" size=\"2\">Washington State University Voiland College Professional Practice and Experiential Learning office reserves the right to anonymously track and report a user&rsquo;s activity inside of the Voiland PPEL Career Development website and application.&nbsp; If you have questions or comments about the Voiland PPEL Career Development Application, please contact the Voiland PPEL office at vcea.internships@wsu.edu.</font></p>\n</body>\n</html>\n"}]}